In [5]:
import pandas as pd
import numpy as np

In [8]:
data = 'Ex_Files_Python_Data_Visualization/Exercise_Files/3 Pandas/data/car_financing.xlsx'

# Loading excel dataset

In [11]:
df = pd.read_excel(data)
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [85]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.tail()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
403,56,3951.11,796.01,9.54,786.47,3164.64,60,0.029,VW Golf R
404,57,3164.64,796.01,7.64,788.37,2376.27,60,0.029,VW Golf R
405,58,2376.27,796.01,5.74,790.27,1586.00,60,0.029,VW Golf R
406,59,1586.00,796.01,3.83,792.18,793.82,60,0.029,VW Golf R
407,60,793.82,796.01,1.91,794.10,-0.28,60,0.029,VW Golf R

In [13]:
#Select one columns using double brackets

df[['car_type']].head()

        car_type
0  Toyota Sienna
1  Toyota Sienna
2  Toyota Sienna
3  Toyota Sienna
4  Toyota Sienna

In [14]:
#Selecting nultiple columns using double brackets 

df[['car_type','Principal Paid']].head()

        car_type  Principal Paid
0  Toyota Sienna          484.30
1  Toyota Sienna          487.13
2  Toyota Sienna          489.98
3  Toyota Sienna          492.85
4  Toyota Sienna          495.73

In [15]:
#This is Pandas DataFrame.(when we are using double brackets)

type(df[['car_type']])

pandas.core.frame.DataFrame

In [17]:
#Another way to select one column is using single brackets
# And this produces a PANDAS SERIES.

df['car_type'].head()

0    Toyota Sienna
1    Toyota Sienna
2    Toyota Sienna
3    Toyota Sienna
4    Toyota Sienna
Name: car_type, dtype: object

In [18]:
type(df['car_type'])

pandas.core.series.Series

In [19]:
#You can't select multiple columns using single bracket it gives key error

df['car_type','Principal Paid']

KeyError: ('car_type', 'Principal Paid')

# Slicing

In [21]:
df['car_type'][0:10]

0    Toyota Sienna
1    Toyota Sienna
2    Toyota Sienna
3    Toyota Sienna
4    Toyota Sienna
5    Toyota Sienna
6    Toyota Sienna
7    Toyota Sienna
8    Toyota Sienna
9    Toyota Sienna
Name: car_type, dtype: object

In [22]:
#using dataframe
df.loc[:,['car_type']].head()

        car_type
0  Toyota Sienna
1  Toyota Sienna
2  Toyota Sienna
3  Toyota Sienna
4  Toyota Sienna

In [23]:
#using pandas series

df.loc[:,'car_type'].head()

0    Toyota Sienna
1    Toyota Sienna
2    Toyota Sienna
3    Toyota Sienna
4    Toyota Sienna
Name: car_type, dtype: object

# Filtering

In [24]:
df['car_type'].value_counts()

VW Golf R         144
Toyota Sienna     120
Toyota Carolla    111
Toyota Corolla     33
Name: car_type, dtype: int64

In [27]:
car_filter = df['car_type'] =='Toyota Sienna'
car_filter.head() # for boolean output

0    True
1    True
2    True
3    True
4    True
Name: car_type, dtype: bool

In [29]:
#Filtered dataframe of only "Toyota Sienna"
df[car_filter].head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [36]:
#Second approach using slicing " loc "
#filtered dataframe

df_Toyota_Sienna = df.loc[car_filter,:]
df_Toyota_Sienna.count()

Month               120
Starting Balance    120
Repayment           120
Interest Paid       119
Principal Paid      120
New Balance         120
term                120
interest_rate       120
car_type            120
dtype: int64

In [34]:
df_Toyota_Sienna['interest_rate'].value_counts()

0.0702    60
0.0359    60
Name: interest_rate, dtype: int64

In [37]:
df_Toyota_Sienna['interest_rate'] == 0.0702

0       True
1       True
2       True
3       True
4       True
5       True
6       True
7       True
8       True
9       True
10      True
11      True
12      True
13      True
14      True
15      True
16      True
17      True
18      True
19      True
20      True
21      True
22      True
23      True
24      True
25      True
26      True
27      True
28      True
29      True
       ...
90     False
91     False
92     False
93     False
94     False
95     False
96     False
97     False
98     False
99     False
100    False
101    False
102    False
103    False
104    False
105    False
106    False
107    False
108    False
109    False
110    False
111    False
112    False
113    False
114    False
115    False
116    False
117    False
118    False
119    False
Name: interest_rate, Length: 120, dtype: bool

In [38]:
interest_filter = df_Toyota_Sienna['interest_rate']==0.0702

In [46]:
df_interest_filter = df_Toyota_Sienna.loc[interest_filter,:]

In [48]:
df_interest_filter['interest_rate'].value_counts()

0.0702    60
Name: interest_rate, dtype: int64

In [51]:
#Another and much eaiser way to get filtered dataframe.


filter_df = df.loc[car_filter & interest_filter,:]
filter_df['interest_rate'].value_counts()

0.0702    60
Name: interest_rate, dtype: int64

# Managing Columns

            1.Renaming
            2. Deleting

In [54]:
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [64]:
df['Principal Paid'].head()

0    484.30
1    487.13
2    489.98
3    492.85
4    495.73
Name: Principal Paid, dtype: float64

RENAMING

In [67]:
#Approach 1 dictionary substitution using rename function

df = df.rename(columns={'Starting Balance' : 'starting_balance',
              'Interest Paid' : 'interest_paid',
              'Principal Paid':'principal_paid',
              'New Balance':'new_balance'})

In [68]:
df.head()

,Month,starting_balance,Repayment,interest_paid,principal_paid,new_balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [73]:
# Approach 2 is uisng list replacement

df.columns=['month',
           'starting_balance',
            'Repayment',
           'interest_paid',
           'principal_paid',
            'new_balance','term','interest_rate','car_type']

In [74]:
df.head()

,month,starting_balance,Repayment,interest_paid,principal_paid,new_balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

DELETING

In [82]:
df = df.drop(columns=['Repayment'],axis=0)

In [84]:
df.head()

   month  starting_balance  interest_paid  principal_paid  new_balance
0      1          34689.96         202.93          484.30     34205.66
1      2          34205.66         200.10          487.13     33718.53
2      3          33718.53         197.25          489.98     33228.55
3      4          33228.55         194.38          492.85     32735.70
4      5          32735.70         191.50          495.73     32239.97

In [98]:
# filter_df['Interest Paid'].sum()

In [99]:
# filter_df['Interest Paid'] = filter_df['Interest Paid'].interpolate(method = 'linear')
# filter_df['Interest Paid'].sum()

In [100]:
# filter_df.isnull().sum()